{"id": "cce2878c-8266-4c66-98d4-ef06004c458e", "rule_id": "be4e0a10-2ad5-4690-b8fd-de44f2df7ebf", "name": "[Duplicate] Possible FIN7 DGA Command and Control Behavior", "immutable": false, "rule_source": {"type": "internal"}, "version": 111, "revision": 8, "updated_at": "2026-03-08T14:06:50.235Z", "updated_by": "elastic", "created_at": "2025-10-25T01:33:30.742Z", "created_by": "elastic", "enabled": true, "interval": "5m", "from": "now-9m", "to": "now", "description": "This rule detects a known command and control pattern in network events. The FIN7 threat group is known to use this command and control technique, while maintaining persistence in their target's network.", "tags": ["Use Case: Threat Detection", "Tactic: Command and Control", "Domain: Endpoint", "Resources: Investigation Guide", "Custom", "Data Source: Fortinet", "Data Source: Fortinet FortiGate"], "author": ["Elastic", "Yousef M.Helmy"], "license": "Elastic License v2", "threat": [{"framework": "MITRE ATT&CK", "tactic": {"id": "TA0011", "name": "Command and Control", "reference": "https://attack.mitre.org/tactics/TA0011/"}, "technique": [{"id": "T1071", "name": "Application Layer Protocol", "reference": "https://attack.mitre.org/techniques/T1071/"}, {"id": "T1568", "name": "Dynamic Resolution", "reference": "https://attack.mitre.org/techniques/T1568/", "subtechnique": [{"id": "T1568.002", "name": "Domain Generation Algorithms", "reference": "https://attack.mitre.org/techniques/T1568/002/"}]}]}], "timeline_id": "300afc76-072d-4261-864d-4149714bf3f1", "timeline_title": "Comprehensive Network Timeline", "investigation_fields": {"field_names": ["url.domain"]}, "related_integrations": [{"package": "fortinet_fortigate", "version": "^1.36.2"}], "required_fields": [{"name": "url.domain", "type": "keyword", "ecs": true}], "setup": "", "note": "## Triage and analysis\n\nIn the event this rule identifies benign domains in your environment, the `url.domain` field in the rule can be modified to include those domains. Example: `...AND NOT url.domain:(zoom.us OR benign.domain1 OR benign.domain2)`.", "false_positives": ["This rule could identify benign domains that are formatted similarly to FIN7's command and control algorithm. Alerts should be investigated by an analyst to assess the validity of the individual observations."], "references": ["https://www.fireeye.com/blog/threat-research/2018/08/fin7-pursuing-an-enigmatic-and-evasive-global-criminal-operation.html"], "risk_score": 73, "risk_score_mapping": [], "severity": "high", "severity_mapping": [], "timestamp_override": "event.ingested", "timestamp_override_fallback_disabled": false, "output_index": "", "max_signals": 100, "exceptions_list": [{"id": "f08d2130-1954-43d2-aceb-ddfc458ea483", "list_id": "8a9c471e-901f-4a38-a5b7-be6fcd6c4e01", "type": "rule_default", "namespace_type": "single"}], "actions": [], "meta": {"kibana_siem_app_url": ""}, "type": "query", "language": "lucene", "data_view_id": "4c8101ef-184b-49d5-b3fa-265c2195749a", "query": "(event.category: network AND network.transport: tcp) AND\nurl.domain:/[a-zA-Z]{4,5}\\.(pw|us|club|info|site|top)/ AND NOT url.domain:zoom.us\n", "filters": []}
