{"id": "d24d90f9-656f-42b0-9a2e-b9c9ed060cb0", "rule_id": "70a866a8-fa52-45bf-92b9-68506b3e55a1", "name": "[Production] Elastic Agent is Offline", "immutable": false, "rule_source": {"type": "internal"}, "version": 1, "revision": 5, "updated_at": "2026-02-08T17:45:26.703Z", "updated_by": "elastic", "created_at": "2026-02-07T08:26:37.018Z", "created_by": "soc.admin", "enabled": true, "interval": "5m", "from": "now-9m", "to": "now", "description": "This alert indicates that an agent has gone offline.", "tags": ["Custom", "Fleet", "Elastic Agent", "Engineering"], "author": ["Saeed Elfiky", "Yousef M.Helmy"], "license": "", "threat": [], "related_integrations": [], "required_fields": [], "setup": "", "note": "1. Check if the agent has gone online before notifying the client\n2. Notify the client to check the service status for Elastic Agent service in the offline endpoint and to restart it\n3. If the client wasn't able to enable the agent, notify the SIEM engineer", "false_positives": [], "references": ["https://www.elastic.co/docs/solutions/security/configure-elastic-defend/configure-offline-endpoints-air-gapped-environments"], "risk_score": 73, "risk_score_mapping": [], "severity": "high", "severity_mapping": [], "timestamp_override": "event.ingested", "timestamp_override_fallback_disabled": false, "output_index": "", "max_signals": 10, "exceptions_list": [], "actions": [], "meta": {"kibana_siem_app_url": "https://192.168.5.110:5601/app/security"}, "type": "esql", "language": "esql", "query": "FROM logs-elastic_agent.status_change-default, *:logs-elastic_agent.status_change-default metadata _id, _version, _index\r\n| WHERE data_stream.dataset == \"elastic_agent.status_change\" and agentless == false and health_status == \"offline\"\r\n| RENAME hostname AS host.name\r\n| KEEP _id, _index, @timestamp, agent.id, data_stream.dataset, host.name, status"}
