{"id": "0663ee05-33b3-4fb0-9048-07591df88183", "rule_id": "608e517c-864c-4126-aa2f-e9601dabdc62", "name": "[Production] Kaspersky Security Center - Critical Alerts", "immutable": false, "rule_source": {"type": "internal"}, "version": 3, "revision": 5, "updated_at": "2026-03-08T14:10:46.307Z", "updated_by": "elastic", "created_at": "2025-09-11T11:36:30.934Z", "created_by": "elastic", "enabled": true, "interval": "5m", "from": "now-9m", "to": "now", "description": "This rule groups some critical event type from Kaspersky Security Center (KSC) and present them as they are. This is currently for testing and will be changed in the future.", "tags": ["Custom", "Data Source: Kaspersky Security Center"], "author": ["Yousef M.Helmy"], "license": "", "threat": [], "investigation_fields": {"field_names": ["kaspersky.event_type", "kaspersky.category", "kaspersky.description", "user.name", "source.ip"]}, "related_integrations": [], "required_fields": [], "setup": "", "note": "Check the kaspersky parameters and the description for more data related to the alert. If the alerted asset was included as a Fleet agent, check the file, process, network, and registry events for more insights.", "false_positives": [], "references": ["https://support.kaspersky.com/ksc/14.0/177080"], "risk_score": 60, "risk_score_mapping": [], "severity": "high", "severity_mapping": [], "rule_name_override": "kaspersky.event_type", "output_index": "", "max_signals": 1, "exceptions_list": [], "actions": [], "meta": {"kibana_siem_app_url": "https://192.168.5.110:5601/app/security"}, "type": "query", "language": "kuery", "data_view_id": "5445a910-088d-4007-a512-861ba48aebf3", "query": "kaspersky.event_type : (\"Virus outbreak\" OR \"Virus outbreak\" OR  \"Malicious object detected\" OR \"Disinfection impossible\") OR (kaspersky.event_type:\"Network attack detected\" AND NOT kaspersky.parameter1: \"Scan.Generic.PortScan.TCP\")", "filters": []}
