{"id": "c528b6eb-ab33-4511-92a2-d7d3a6de9f59", "rule_id": "41eec52f-536a-48c7-9109-6a1733a75c38", "name": "[Testing] Cisco ASA - Firewall logs stopped streaming", "immutable": false, "rule_source": {"type": "internal"}, "version": 2, "revision": 6, "updated_at": "2026-03-08T13:58:40.174Z", "updated_by": "elastic", "created_at": "2025-10-20T13:56:47.554Z", "created_by": "soc.admin", "enabled": true, "interval": "30m", "from": "now-1h", "to": "now", "description": "Detects when Cisco ASA firewall logs have stopped streaming to Elasticsearch, which could indicate a potential issue with log forwarding or that the size limit has been reached.", "tags": ["Custom"], "author": ["SOC Admin: Saeed "], "license": "", "threat": [{"framework": "MITRE ATT&CK", "tactic": {"id": "TA0040", "name": "Impact", "reference": "https://attack.mitre.org/tactics/TA0040/"}, "technique": []}], "related_integrations": [{"package": "cisco_asa", "version": "^2.44.1"}], "required_fields": [], "setup": "", "note": "1. Check if it is still not streaming any logs, and check the last time it received logs\n2. Check the related integration if it is unhealthy or offline, and if it is, investigate what the root cause might be\n3. Investigate the last activity before the firewall went down\n4. Open a ticket to the network team reporting the findings", "false_positives": [], "references": [], "risk_score": 73, "risk_score_mapping": [], "severity": "high", "severity_mapping": [], "output_index": "", "max_signals": 100, "exceptions_list": [], "actions": [], "meta": {"kibana_siem_app_url": "https://192.168.5.110:5601/app/security"}, "type": "esql", "language": "esql", "query": "FROM logs-cisco_asa.log-default\r\n| STATS Count = count()\r\n| WHERE Count == 0\r\n| LIMIT 1"}
