{"id": "75f7d52d-9fbe-4b99-bca7-a71014094177", "rule_id": "bbe2c033-6dda-4179-99f0-ad283ac96a5f", "name": "[Testing] FortiGate - Infected File Detected", "immutable": false, "rule_source": {"type": "internal"}, "version": 3, "revision": 3, "updated_at": "2026-03-08T14:06:50.236Z", "updated_by": "elastic", "created_at": "2026-03-08T11:59:24.199Z", "created_by": "elastic", "enabled": true, "interval": "5m", "from": "now-6m", "to": "now", "description": "Generated when the FortiGate antivirus engine detects malware in a scanned file. According to Fortinet documentation, this event indicates an “infected file detected by the FortiGate unit and blocked.", "tags": ["Custom", "Data Source: Fortinet", "Data Source: Fortinet FortiGate"], "author": ["Mohamed Ibrahim"], "license": "", "threat": [{"framework": "MITRE ATT&CK", "tactic": {"id": "TA0002", "name": "Execution", "reference": "https://attack.mitre.org/tactics/TA0002/"}, "technique": [{"id": "T1204", "name": "User Execution", "reference": "https://attack.mitre.org/techniques/T1204/", "subtechnique": [{"id": "T1204.002", "name": "Malicious File", "reference": "https://attack.mitre.org/techniques/T1204/002/"}]}]}], "timeline_id": "300afc76-072d-4261-864d-4149714bf3f1", "timeline_title": "Comprehensive Network Timeline", "investigation_fields": {"field_names": ["file.name", "event.action", "fortinet.firewall.subtype", "fortinet.firewall.analyticscksum"]}, "related_integrations": [{"package": "fortinet_fortigate", "version": "^1.36.2"}], "required_fields": [], "setup": "", "note": "1. Review the file name and path.\n2. Check the `message` field to identify the infected event type (e.g., File, Traffic, or C2).\n3. Examine the alert reason using `fortinet.firewall.virus` and `fortinet.firewall.viruscat fields`.\n4. Verify the file reputation from `fortinet.firewall.analyticscksum` if available, or coordinate with IT to retrieve it, then search in threat intelligence sources.\n⚠️ Do not upload the file to public TI sources", "false_positives": ["A file that was detected and reported before", "False positive signature legitimate file"], "references": ["https://docs.fortinet.com/document/fortigate/7.4.1/fortios-log-message-reference/807724/antivirus-log-support-for-cef"], "risk_score": 47, "risk_score_mapping": [], "severity": "medium", "severity_mapping": [], "timestamp_override": "event.ingested", "timestamp_override_fallback_disabled": false, "output_index": "", "max_signals": 1, "exceptions_list": [], "actions": [], "meta": {"kibana_siem_app_url": "https://192.168.5.110:5601/app/security"}, "type": "new_terms", "query": "event.action: \"infected\" ", "new_terms_fields": ["file.name"], "history_window_start": "now-7d", "filters": [], "language": "kuery", "data_view_id": "4c8101ef-184b-49d5-b3fa-265c2195749a"}
