{"id": "6261b01b-1b66-4b74-996c-da2bd4d5ba60", "rule_id": "20225679-689c-4f3b-98ef-a0adf87b7af8", "name": "[Testing] FortiGate - High number of deny traffic", "immutable": false, "rule_source": {"type": "internal"}, "version": 2, "revision": 5, "updated_at": "2026-03-08T14:00:02.159Z", "updated_by": "elastic", "created_at": "2025-10-16T10:27:02.050Z", "created_by": "elastic", "enabled": true, "interval": "30m", "from": "now-59m", "to": "now", "description": "Detects when a thousand requests occur during a 30-second timeframe, which are all \"deny\" from a private IP. This indicates an abnormal activity that should be reported to the network team.", "tags": ["Custom", "Data Source: Fortinet", "Data Source: Fortinet FortiGate"], "author": ["Yousef M.Helmy"], "license": "", "threat": [{"framework": "MITRE ATT&CK", "tactic": {"id": "TA0040", "name": "Impact", "reference": "https://attack.mitre.org/tactics/TA0040/"}, "technique": [{"id": "T1498", "name": "Network Denial of Service", "reference": "https://attack.mitre.org/techniques/T1498/", "subtechnique": [{"id": "T1498.001", "name": "Direct Network Flood", "reference": "https://attack.mitre.org/techniques/T1498/001/"}]}]}], "investigation_fields": {"field_names": ["source.ip", "destination.ip", "total_logs"]}, "related_integrations": [{"package": "fortinet_fortigate", "version": "^1.36.2"}], "required_fields": [], "setup": "", "note": "1. Check the destination IPs and the URL domains of the source IP recipients. Check the user involved in the incident from the host.name field\n2. Check the [\"FortiGate Actions per Time\"](https://192.168.5.110:5601/app/lens#/edit/59cf142b-9a16-4ab1-a5dc-3406a1318357?_g=(filters:!(),refreshInterval:(pause:!t,value:60000),time:(from:now/d,to:now/d))) visualization and filter by the source IP to understand the timeline fully\n3. Report these findings to the network team", "false_positives": [], "references": [], "risk_score": 56, "risk_score_mapping": [], "severity": "medium", "severity_mapping": [], "output_index": "", "max_signals": 10, "exceptions_list": [{"id": "1f10b786-348e-4ed2-98e9-ed7ebd349943", "list_id": "a10b06c3-1859-4c98-89a1-644ebbfe568c", "type": "rule_default", "namespace_type": "single"}], "actions": [], "meta": {"kibana_siem_app_url": "https://192.168.5.110:5601/app/security"}, "type": "esql", "language": "esql", "query": "FROM logs-fortinet_fortigate.log-*\r\n| WHERE event.action == \"deny\" \r\n| WHERE CIDR_MATCH(source.ip,\"10.0.0.0/8\" , \"127.0.0.0/8\" , \"169.254.0.0/16\" , \"172.16.0.0/12\" , \"192.0.0.0/24\" , \"192.0.0.0/29\" , \"192.0.0.8/32\" , \"192.0.0.9/32\" , \"192.0.0.10/32\" , \"192.0.0.170/32\" , \"192.0.0.171/32\" , \"192.0.2.0/24\" , \"192.31.196.0/24\" , \"192.52.193.0/24\" , \"192.168.0.0/16\" , \"192.88.99.0/24\" , \"224.0.0.0/4\" , \"100.64.0.0/10\" , \"192.175.48.0/24\" , \"198.18.0.0/15\" , \"198.51.100.0/24\" , \"203.0.113.0/24\" , \"240.0.0.0/4\" , \"::1\" , \"FE80::/10\" , \"FF00::/8\")\r\n| STATS total_logs = COUNT(*) BY BUCKET(@timestamp, 30 second), source.ip, destination.ip\r\n| WHERE total_logs > 1000\r\n| LIMIT 1000"}
