{"id": "3bc6b920-d5b5-4f12-8f0f-d88fd5a2d6a7", "rule_id": "1cd53345-9656-42ac-b914-fc4afd93734c", "name": "[Testing] LanmanServer NullSessionPipes or RestrictNullSessAccess Modification", "immutable": false, "rule_source": {"type": "internal"}, "version": 2, "revision": 2, "updated_at": "2026-03-09T08:36:46.837Z", "updated_by": "elastic", "created_at": "2025-10-16T07:16:11.336Z", "created_by": "elastic", "enabled": true, "interval": "5m", "from": "now-9m", "to": "now", "description": "Detect modification of LanmanServer\\Parameters\\nullsessionpipes or restrictnullsessaccess via Sysmon or Security Event logs.", "tags": ["Custom"], "author": ["Marwan Elsayyad"], "license": "", "threat": [], "investigation_fields": {"field_names": ["registry.path", "process.name", "user.name", "host.name", "@timestamp"]}, "related_integrations": [{"package": "endpoint", "version": "^9.2.0"}], "required_fields": [], "setup": "", "false_positives": [], "references": [], "risk_score": 70, "risk_score_mapping": [], "severity": "high", "severity_mapping": [], "output_index": "", "max_signals": 100, "exceptions_list": [], "actions": [], "meta": {"kibana_siem_app_url": "https://192.168.5.110:5601/app/security"}, "type": "query", "language": "kuery", "data_view_id": "0eb05adf-abb4-4acd-bc56-4b10b997a65c", "query": "registry.path: *LanmanServer\\\\Parameters\\\\nullsessionpipes* OR registry.path: *LanmanServer\\\\Parameters\\\\restrictnullsessaccess*", "filters": []}
