{"id": "5b1a6663-23ca-454c-84c7-e4209a99a4b0", "rule_id": "faaa8b69-7eae-4d89-bc8e-7bf3e431c74e", "name": "[Testing] FortiGate - Firewall logs stopped streaming", "immutable": false, "rule_source": {"type": "internal"}, "version": 3, "revision": 9, "updated_at": "2026-03-08T14:00:02.155Z", "updated_by": "elastic", "created_at": "2025-10-16T10:33:42.150Z", "created_by": "elastic", "enabled": true, "interval": "10m", "from": "now-15m", "to": "now", "description": "Detects when FortiGate firewall logs have stopped streaming to Elasticsearch, which could indicate a potential issue with log forwarding or that the size limit has been reached.", "tags": ["Custom", "Data Source: Fortinet", "Data Source: Fortinet FortiGate"], "author": ["Yousef M.Helmy"], "license": "", "threat": [{"framework": "MITRE ATT&CK", "tactic": {"id": "TA0040", "name": "Impact", "reference": "https://attack.mitre.org/tactics/TA0040/"}, "technique": []}, {"framework": "MITRE ATT&CK", "tactic": {"id": "TA0005", "name": "Defense Evasion", "reference": "https://attack.mitre.org/tactics/TA0005/"}, "technique": []}], "related_integrations": [{"package": "fortinet_fortigate", "version": "^1.36.2"}], "required_fields": [], "setup": "", "note": "1. Check if it is still not streaming any logs, and check the last time it received logs\n2. Check the related integration if it is unhealthy or offline, and if it is, investigate what the root cause might be\n3. Investigate the last activity before the firewall went down\n4. Open a ticket to the network team reporting the findings", "false_positives": [], "references": [], "risk_score": 73, "risk_score_mapping": [], "severity": "high", "severity_mapping": [], "output_index": "", "max_signals": 100, "exceptions_list": [], "actions": [], "meta": {"kibana_siem_app_url": "https://192.168.5.110:5601/app/security"}, "type": "esql", "language": "esql", "query": "FROM .ds-logs-fortinet_fortigate.log-default-* \r\n| STATS Count = count()\r\n| WHERE Count == 0\r\n| LIMIT 1"}
